#include <stdio.h>
#include <stdlib.h>

void proc1() // процедура
{
    printf("www\n");
    printf("123\n");
    printf("Процедура виконується для того,\nщоб одним викликом виконати одразу декілька команд.\n\n");
}

// у круглих ("тут вхідне значення") дужках, ми можемо передавати вхідні параметри для процедури або ф-ї

int ret7(int x, int y) // функція, де int - тип результату, який буде повертати ф-я
{
    printf("Функція це теж саме, що і процедура,\nале повертає значення результату у якості свого виконання.\n\n");
    return x + y ;
}


int main() // ф-я, яка є точкою входу у програму
{
    system("color 2");
    system("chcp 1251");

    int t;
    t = ret7(1, 1);
    t = ret7(t, 2);
    t = ret7(t, 2);

    printf("Тема: Функції\n\"int main()\" - це функція з типом int\n\n");
    proc1();
    printf("t = %d",t);

    return 0;
}
